Revit 2027 API
ExternalDefinitionCreationOptions.SetDataType Method
 Sets the parameter's data type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetDataType(
	ForgeTypeId dataType
)
Public Sub SetDataType (
	dataType As ForgeTypeId
)
public:
void SetDataType(
	ForgeTypeId^ dataType
)
member SetDataType :
        dataType : ForgeTypeId -> unit
Parameters
dataType ForgeTypeId
 The identifier of either a spec or a category. A category identifier indicates a Family Type parameter of that category.
Exceptions
Exception | Condition
ArgumentException |  The given identifier is neither a spec nor a category.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExternalDefinitionCreationOptions Class
Autodesk.Revit.DB Namespace